Revit 2026 API

# FamilyInstanceSymbol Property

---

Returns or changes the FamilySymbol object that represents the type of the instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilySymbol Symbol { get; set; }
```
```vb
Public Property Symbol As FamilySymbol
	Get
	Set
```
```cpp
public:
property FamilySymbol^ Symbol {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
```
```fsharp
member Symbol : FamilySymbol with get, set
```

#### Property Value

FamilySymbol

Setting this property will result in the type of the instance being changed. Related types can be found by examining the Family to which the symbol belongs.

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace